summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCcu6_regdef.h
/** \\brief  Port Input Select Register 2 */
typedef struct _Ifx_CCU6_PISEL2_Bits
{
    unsigned int IST13HR:2;                 /**< \brief [1:0] Input Select for T13HR (rw) */
    unsigned int ISCNT12:2;                 /**< \brief [3:2] Input Select for T12 Counting Input (rw) */
    unsigned int ISCNT13:2;                 /**< \brief [5:4] Input Select for T13 Counting Input (rw) */
    unsigned int T12EXT:1;                  /**< \brief [6:6] Extension for T12HR Inputs (rw) */
    unsigned int T13EXT:1;                  /**< \brief [7:7] Extension for T13HR Inputs (rw) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_CCU6_PISEL2_Bits;

/** \\brief  Passive State Level Register */
typedef struct _Ifx_CCU6_PSLR_Bits
{
    unsigned int PSL:6;                     /**< \brief [5:0] Compare Outputs Passive State Level (rwh) */
    unsigned int reserved_6:1;              /**< \brief \internal Reserved */
    unsigned int PSL63:1;                   /**< \brief [7:7] Passive State Level of Output COUT63 (rwh) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_CCU6_PSLR_Bits;

/** \\brief  Timer T12 Counter Register */
typedef struct _Ifx_CCU6_T12_Bits
{
    unsigned int T12CV:16;                  /**< \brief [15:0] Timer 12 Counter Value (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_T12_Bits;

/** \\brief  Dead-Time Control Register for Timer12 */
typedef struct _Ifx_CCU6_T12DTC_Bits
{
    unsigned int DTM:8;                     /**< \brief [7:0] Dead-Time (rw) */
    unsigned int DTE0:1;                    /**< \brief [8:8] Dead Time Enable Bits (rw) */
    unsigned int DTE1:1;                    /**< \brief [9:9] Dead Time Enable Bits (rw) */
    unsigned int DTE2:1;                    /**< \brief [10:10] Dead Time Enable Bits (rw) */
    unsigned int reserved_11:1;             /**< \brief \internal Reserved */
    unsigned int DTR0:1;                    /**< \brief [12:12] Dead Time Run Indication Bits (rh) */
    unsigned int DTR1:1;                    /**< \brief [13:13] Dead Time Run Indication Bits (rh) */
    unsigned int DTR2:1;                    /**< \brief [14:14] Dead Time Run Indication Bits (rh) */
    unsigned int reserved_15:17;            /**< \brief \internal Reserved */
} Ifx_CCU6_T12DTC_Bits;

/** \\brief  T12 Mode Select Register */
typedef struct _Ifx_CCU6_T12MSEL_Bits
{
    unsigned int MSEL60:4;                  /**< \brief [3:0] Capture/Compare Mode Selection (rw) */
    unsigned int MSEL61:4;                  /**< \brief [7:4] Capture/Compare Mode Selection (rw) */
    unsigned int MSEL62:4;                  /**< \brief [11:8] Capture/Compare Mode Selection (rw) */
    unsigned int HSYNC:3;                   /**< \brief [14:12] Hall Synchronization (rw) */
    unsigned int DBYP:1;                    /**< \brief [15:15] Delay Bypass (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_T12MSEL_Bits;

/** \\brief  Timer 12 Period Register */
typedef struct _Ifx_CCU6_T12PR_Bits
{
    unsigned int T12PV:16;                  /**< \brief [15:0] T12 Period Value (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_T12PR_Bits;

/** \\brief  Timer T13 Counter Register */
typedef struct _Ifx_CCU6_T13_Bits
{
    unsigned int T13CV:16;                  /**< \brief [15:0] Timer 13 Counter Value (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_T13_Bits;

/** \\brief  Timer 13 Period Register */
typedef struct _Ifx_CCU6_T13PR_Bits
{
    unsigned int T13PV:16;                  /**< \brief [15:0] T13 Period Value (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_T13PR_Bits;

/** \\brief  Timer Control Register 0 */
typedef struct _Ifx_CCU6_TCTR0_Bits
{
    unsigned int T12CLK:3;                  /**< \brief [2:0] Timer T12 Input Clock Select (rw) */
    unsigned int T12PRE:1;                  /**< \brief [3:3] Timer T12 Prescaler Bit (rw) */
    unsigned int T12R:1;                    /**< \brief [4:4] Timer T12 Run BitA concurrent set/clear action on T12R (from T12SSC, T12RR or T12RS) will have no effect. The bit T12R will remain unchanged. (rh) */
    unsigned int STE12:1;                   /**< \brief [5:5] Timer T12 Shadow Transfer Enable (rh) */
    unsigned int CDIR:1;                    /**< \brief [6:6] Count Direction of Timer T12 (rh) */
    unsigned int CTM:1;                     /**< \brief [7:7] T12 Operating Mode (rw) */
    unsigned int T13CLK:3;                  /**< \brief [10:8] Timer T13 Input Clock Select (rw) */
    unsigned int T13PRE:1;                  /**< \brief [11:11] Timer T13 Prescaler Bit (rw) */
    unsigned int T13R:1;                    /**< \brief [12:12] Timer T13 Run BitA concurrent set/cleared action on T13R (from T13SSC, T13TEC, T13RR or T13RS) will have no effect. The bit T12R will remain unchanged. (rh) */
    unsigned int STE13:1;                   /**< \brief [13:13] Timer T13 Shadow Transfer Enable (rh) */
    unsigned int reserved_14:18;            /**< \brief \internal Reserved */
} Ifx_CCU6_TCTR0_Bits;

/** \\brief  Timer Control Register 2 */
typedef struct _Ifx_CCU6_TCTR2_Bits
{
    unsigned int T12SSC:1;                  /**< \brief [0:0] Timer T12 Single Shot Control (rw) */
    unsigned int T13SSC:1;                  /**< \brief [1:1] Timer T13 Single Shot Control (rw) */
    unsigned int T13TEC:3;                  /**< \brief [4:2] T13 Trigger Event Control (rw) */
    unsigned int T13TED:2;                  /**< \brief [6:5] Timer T13 Trigger Event DirectionExample: If the timer T13 is intended to start at any compare event on T12 (T13TEC=100) the trigger event direction can be programmed to - counting up >> a T12 channel 0, 1, 2 compare match triggers T13R only while T12 is counting up - counting down >> a T12 channel 0, 1, 2 compare match triggers T13R only while T12 is counting down - independent from bit CDIR >> each T12 channel 0, 1, 2 compare match triggers T13R The timer count direction is taken from the value of bit CDIR. As a result, if T12 is running in edge-aligned mode (counting up only), T13 can only be started automatically if bit field T13TED=01 or 11. (rw) */
    unsigned int reserved_7:1;              /**< \brief \internal Reserved */
    unsigned int T12RSEL:2;                 /**< \brief [9:8] Timer T12 External Run Selection (rw) */
    unsigned int T13RSEL:2;                 /**< \brief [11:10] Timer T13 External Run Selection (rw) */
    unsigned int reserved_12:20;            /**< \brief \internal Reserved */
} Ifx_CCU6_TCTR2_Bits;

